package com.banyechan.spring5_webflux.entity;

import java.util.List;

/**
 * 佛经
 */
public class BuddhistScripture {

    private List<String> buddhistList;


    private final static String XIN_JING = "观自在菩萨，行深般若波蜜多时，照见五蕴皆空，度一切苦厄。" +
            "舍利子，色不异空，空不异色，色即是空，空既是色，受想行识，亦复如是。" +
            "舍利子，是诸法空相，不生不灭，不垢不净，不增不减。是故空中无色，无受想行识，" +
            "无眼耳鼻舌身意，无色声香味触法，无眼界乃至无意识界，无无明亦无无明尽，" +
            "乃至无老死，亦无老死尽。无苦集灭道，无智亦无得，以无所得故。" +
            "菩提萨陲，以般若波罗蜜多故，心无挂碍，无挂碍故，无有恐怖，远离颠倒梦想，究竟涅槃。" +
            "三世诸佛，依般若波罗蜜多故，得阿耨多罗三藐三菩提。" +
            "故知般若波罗蜜多，是大神咒，是大明咒，是无上咒，是无等等咒，能除一切苦，真实不虚。" +
            "故说般若波罗蜜多咒，即说咒曰：揭谛揭谛，波罗揭谛，波罗僧揭谛，菩提萨婆诃。";


    private final static String HAO_LE_GE_ZHU = "陋室空堂，当年笏满床；衰草枯杨，曾为歌舞场。" +
            "蛛丝儿结满雕梁，绿纱今又糊在蓬窗上。说什么脂正浓，粉正香，如何两鬓又成霜？" +
            "昨日黄土陇头埋白骨，今宵红灯帐底卧鸳鸯。金满箱，银满箱，转眼乞丐人皆谤。" +
            "正叹他人命不长，哪知自己归来丧？训有方，保不定日后做强梁；择膏粱，谁承望流落在烟花巷。" +
            "因嫌纱帽小，致使锁枷杠。昨怜破袄寒，今嫌紫蟒长。乱哄哄，你方唱罢我登场，反认他乡是故乡，" +
            "甚荒唐，到头来都是为他人作嫁衣裳。";

    public static void main(String[] args) {
        System.out.println(XIN_JING);
    }

}
